[
    {
        "slug": "tyres",
        "title": "Tyres",
        "description": "Your tyres are the only thing between your car and the road, and their condition defines safety, handling, and efficiency. At A Mechanical Repairs, we supply premium new tyres and carefully inspected used options to fit every budget. From compact cars to family SUVs and heavy-duty utes, we’ve got the right sizes and brands. Our team helps you choose the best tyre for your driving style, ensuring long-lasting grip and peace of mind in all weather conditions."
    },
    {
        "slug": "battery",
        "title": "Battery",
        "description": "A weak or dead battery is more than an inconvenience – it can leave you stranded. We supply and install high-quality new and tested used batteries from trusted brands. All come with <b>1–3 year warranty options</b>. Our service includes full battery health checks, proper installation, and eco-friendly disposal of your old unit, so you’re never caught off guard again."
    },
    {
        "slug": "brake-servicing",
        "title": "Brake Servicing",
        "description": "Your braking system is the most critical safety feature of your vehicle. Our brake service starts at <b>$99</b> and includes full inspection of pads, rotors, and discs. We also service <b>rear drums and brake shoes</b> for specific vehicles, including those with <b>electric hand brakes</b>. All repairs come with a standard warranty covering parts only (terms apply). Drive with confidence knowing your car will stop when it matters most."
    },
    {
        "slug": "timing-belt",
        "title": "Timing Belt",
        "description": "A worn or broken timing belt can cause catastrophic engine damage. Our timing belt replacement service starts from <b>$350</b> (terms & conditions apply). We use manufacturer-approved parts and perform precise installation to keep your engine running smoothly and extend its life. Don’t wait for failure – let our experts keep your car protected."
    },
    {
        "slug": "suspension",
        "title": "Suspension",
        "description": "Suspension issues affect comfort, control, and safety. We repair both <b>front and rear suspension</b>, including shocks, struts, and springs. Our service restores your car’s stability and smoothness, using either genuine or aftermarket parts (terms apply). Enjoy a safe, comfortable, and balanced ride once again."
    },
    {
        "slug": "crash-repairs",
        "title": "Crash Repairs",
        "description": "Accidents happen, but restoring your car to its best condition is our specialty. We handle everything from minor dents to major crash repairs. Using genuine and aftermarket parts (terms apply), we ensure both quality and affordability. With skilled workmanship and attention to detail, your vehicle will be back in <b>best condition</b> – safe, reliable, and looking sharp."
    },
    {
        "slug": "car-wash-detailing",
        "title": "Car Wash & Detailing",
        "description": "A clean car doesn’t just look great – it feels better to drive. Our professional wash and detailing service starts from <b>$250</b> (terms apply). From deep interior cleaning and carpet shampooing to exterior polishing and shine restoration, we make sure your car looks and feels like new. Perfect finish, every time."
    },
    {
        "slug": "brake-pads",
        "title": "Brake Pads",
        "description": "Brake pads wear down over time, reducing stopping power and risking rotor damage. Our replacement service starts from <b>$99</b>, using high-quality pads for smooth, quiet, and reliable braking. Each replacement includes a full brake system check, ensuring safety and responsiveness on the road."
    },
    {
        "slug": "ac-service",
        "title": "AC Service",
        "description": "Driving without air conditioning in Australia is uncomfortable and unsafe in extreme weather. Our AC service includes re-gassing, leak detection, and heater repairs, ensuring consistent cooling in summer and heating in winter. With advanced diagnostics and expert repair, we keep your air conditioning running strong all year round."
    },
    {
        "slug": "mobile-car-tow-truck",
        "title": "Mobile Car & Tow Truck Service",
        "description": "Breakdowns and accidents don’t follow schedules, which is why our tow truck and roadside service operates <b>24/7</b>. Whether you’ve got a flat tyre, engine failure, or need accident recovery, our team arrives quickly to get you moving. Safe, reliable, and stress-free roadside assistance whenever you need it."
    }
]